app/views/dogs/_walks_links.html.erb

SELECT "walks".* FROM "walks" INNER JOIN "dogs_walks" ON "walks"."id" = "dogs_walks"."walk_id" WHERE "dogs_walks"."dog_id" = ?  [["dog_id", 7]]
---
  <h2><%= 'Scheduled Walks'%></h2>
  <% @dog.walks.each do |walk| %>