app/views/users/_scheduled_walks.html.erb

  <%= link_to "#{w.date} @ #{w.time} with #{w.walker_name}", user_walk_path(@user.id, w.id) %><br>
  <%= safe_join(w.dogs.map { |d| d.name}, ', ') %><br /><br /><br />
---
SELECT "dogs".* FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]