app/views/welcome/home.html.erb

    <%= "Currently, Walkeeze's most active dog is:" %><br />
    <%= "#{Dog.most_walks.name}, with a total of #{Dog.most_walks.dogs_walks.count} walks!" %><br><br>
---
SELECT COUNT(*) FROM "dogs_walks" WHERE "dogs_walks"."dog_id" = ?  [["dog_id", 1]]