app/views/walks/_add_dogs.html.erb

SELECT  1 AS one FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ? AND "dogs"."id" = ? LIMIT ?  [["walk_id", 1], ["id", 7], ["LIMIT", 1]]
---
      <div>
        <%= check_box_tag "dog_ids[]", d.id, walk.dogs.include?(d) %>