app/views/walks/_form.html.erb

SELECT "dogs"."id" FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
SELECT COUNT(*) FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
---
  <p><%= walk.date %> @ <%= walk.time %></p>
  <p><%= walk.length %> Mins, <%= (walk.available_spots) - (walk.dogs.count) %> spots available </p>