app/views/walks/_show_dogs.html.erb

<% if walk.dogs.count > 0 %>
  <p>The following dogs are booked for this walk!</p>
  <% walk.dogs.each do |d| %>
---
SELECT "dogs".* FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
SELECT COUNT(*) FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]