app/views/walks/_update_dogs.html.erb

SELECT COUNT(*) FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
---
<% if walk.dogs.count > 0 %>