app/controllers/dogs_controller.rb

  def create
    @dog = current_user.dogs.build(dog_params)
    @dog.save
---
INSERT INTO "dogs" ("name", "breed", "age", "user_id", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "bobs first test dog"], ["breed", "mutt"], ["age", 5], ["user_id", 10], ["notes", "no note"], ["created_at", "2018-12-18 17:15:50.762884"], ["updated_at", "2018-12-18 17:15:50.762884"]]

  def schedule
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]