app/controllers/sessions_controller.rb

  def new
    @user = User.find_by(email: params['email'])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bob@bob.com"], ["LIMIT", 1]]

  def create
    # if auth
    #   @user = User.find_or_create_by(uid: auth['uid']) do |u|
    #     u.name = auth['info']['name']
    #     u.email = auth['info']['email']
    #     u.image = auth['info']['image']
    #     u.password = SecureRandom.urlsafe_base64
    #   end
    # else
      if(params[:user][:password_confirmation] && (params[:user][:password] == params[:user][:password_confirmation]))
        @user = User.new(name: params[:user][:name], email: params[:user][:email], password: params[:user][:password], walker: params[:walker])
      end

      if @user && @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "walker") VALUES (?, ?, ?, ?, ?, ?)