app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE (trev@trev.com) LIMIT ?  [["LIMIT", 1]]

  def create
    if user_params[:password] == user_params[:password_confirmation]
      @user = User.find_by_email(user_params[:email])
      if @user
        redirect_to root_path, notice: "You are already registered, Please log in"
      else
        @user = User.create(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "trev@trev.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @dogs = Dog.where(user_id: @user.id)
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 4]]