app/controllers/walks_controller.rb

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @walk = Walk.find(params[:id].to_i)

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @walk = Walk.find(params[:id].to_i)