app/controllers/walks_controller.rb

SELECT "walks".* FROM "walks"
---
  def index
    @walks = Walk.all

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "dogs"."id" FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "walks" ("walker_name", "date", "time", "length", "available_spots", "notes", "created_at", "updated_at", "walker_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "dogs_walks" ("dog_id", "walk_id") VALUES (?, ?)  [["dog_id", 7], ["walk_id", 1]]
SELECT "dogs".* FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
DELETE FROM "dogs_walks" WHERE "dogs_walks"."walk_id" = ? AND "dogs_walks"."dog_id" = ?  [["walk_id", 2], ["dog_id", 9]]
SELECT COUNT(*) FROM "dogs" INNER JOIN "dogs_walks" ON "dogs"."id" = "dogs_walks"."dog_id" WHERE "dogs_walks"."walk_id" = ?  [["walk_id", 1]]
---
  def create
    @walk = Walk.find(params[:id].to_i)
    if params[:dog_ids]
      params[:dog_ids].map(&:to_i).each do |d|
        if !@walk.dogs.ids.include?(d)
          @dog = Dog.find(d)
          @walk.dogs << @dog
        end
      end
    else
      params[:dog_ids]=[]
    end

    @walk.dogs.each do |wd|
      if !params[:dog_ids].map(&:to_i).include?(wd.id)
        if wd.user_id == current_user.id
          @walk.dogs.delete(wd)
        end
      end
    end

    if @walk.dogs.count > @walk.available_spots

SELECT "dogs_walks"."id" FROM "dogs_walks" WHERE "dogs_walks"."dog_id" = ? AND "dogs_walks"."walk_id" = ?  [["dog_id", 7], ["walk_id", 1]]
SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "dogs_walks" SET "notes" = ? WHERE "dogs_walks"."id" = ?  [["notes", "note"], ["id", 9]]
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def update
    @dogs_walk_id = DogsWalk.where(dog_id: params[:dog_id].to_i, walk_id: params[:id].to_i)
    @dog_walk = DogsWalk.find(@dogs_walk_id.ids)[0]
    @dog_walk.notes = params[:note]
    @dog_walk.save
    @dog = Dog.find(params[:dog_id])

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 10]]
---
  def edit
    @walk = Walk.find(params[:id].to_i)
    @dogs = Dog.where(user_id: @user.id)

SELECT  "walks".* FROM "walks" WHERE "walks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @walk = Walk.find(params[:id].to_i)