app/models/dog.rb

SELECT COUNT("dogs_walks"."dog_id") AS count_dog_id, "dogs_walks"."dog_id" AS dogs_walks_dog_id FROM "dogs_walks" GROUP BY "dogs_walks"."dog_id" ORDER BY count_dog_id desc
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.most_walks
    @walk_count = DogsWalk.group("dog_id").order("count_dog_id desc").count("dog_id")
    @dog = Dog.find(@walk_count.keys[0])